templates_veggie/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| VEGGIE CFD -- turbulent viscosity                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fan_exhaust
    {
        type            calculated;
        value           uniform 0;
    }

    "base_inlet_.*"
    {
        type            calculated;
        value           uniform 0;
    }

    "(baseplate|bellows|lightcap|pillow_.*)"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}
