templates_veggie/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| VEGGIE CFD -- specific dissipation rate                                      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 330;

boundaryField
{
    fan_exhaust
    {
        type            inletOutlet;
        inletValue      uniform 330;
        value           uniform 330;
    }

    "base_inlet_.*"
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.0007;        // 0.07 * 0.01 m slot height
        value           uniform 330;
    }

    "(baseplate|bellows|lightcap|pillow_.*)"
    {
        type            omegaWallFunction;
        value           uniform 330;
    }
}
